l['title'] = '';
l['text'] = [];
l['text'][0] = 'Тут пустыня.';
l['text'][1] = 'А за спиной обрыв.';
l['text'][2] = 'Выхода нет, придется идти через этот песок.';
l['text'][3] = '...';
l['text'][4] = 'Кажется, с неба капает совсем не вода.';
l['text'][5] = 'От этого дождя почему-то хочется спать.';
l['text'][6] = 'Так куда же я попал?';
l['text'][7] = 'Как это произошло?';
l['text'][8] = 'Ничего не помню.';
l['text'][9] = '...';
l['text'][10] = 'Песок будто с другой планеты.';
l['text'][11] = 'Это Марс, или, быть может, Юпитер.';
l['text'][12] = '...';
l['text'][13] = 'Но на Юпитере не может быть твердой земли, ведь так?';
l['text'][14] = 'Значит, это Марс.';
l['text'][15] = 'Тогда откуда здесь вода?';
l['text'][16] = 'Слишком много влаги.';
l['text'][17] = '...';
l['text'][18] = 'А еще эти птицы...';
l['text'][19] = 'Вороны? Стервятники?';
l['text'][20] = '...';
l['text'][21] = 'Я ничего не понимаю.';
l['text'][22] = 'Может быть, это сон?';
l['text'][23] = 'Такой реалистичный...';
l['text'][24] = 'Нужно найти людей, если они здесь есть.';
l['text'][25] = 'Или хотя бы укрытие чтобы спрятаться от грозы.';
l['text'][26] = 'Я должен идти.';
l['next'] = 'desert2';
l['img'] = 'res/red_desert_rain.jpg';
l['rain'] = 1;
l['rain'] = 1000;
l['audio'] = 'scene2';
l['compass'] = 0.1;

l['func'] = [];
l['onload'] = function(){
	if(navigator.userAgent.split(' ')[navigator.userAgent.split(' ').length-1].split('/')[0] == "Firefox"){
		for( var i = 0; i < 80; i++){
			g['smoke']['addPoint']( f['w']/2 + f['w']/2*rand(), (f['h']/5) + rand()*(f['h']/10),100, 'rgba(70,70,70, 0.005');
		}
	}else{
		for( var i = 0; i < 100; i++){
			g['smoke']['addPoint']( f['w']*rand(), (f['h']/2.2) + rand()*(f['h']/10),40, 'rgba(90,90,90, 0.03)');
		}
	}
	for(var i = 0; i < 50; i++){
		g['birds']['addPoint'](f['w']*0.1+ rand()*f['w']*0.3, f['h']*0.2+ rand()*f['h']*0.2, 100+ rand()*300, 10+ rand()*60 , rand()*10  , 0.5+rand()*2);
	}
}
l['render'] = function(){
	if(rand>0.85){
		renderThunder(f['w']*0.85 + rand*200 - 100,f['h']*0.30 + rand*20 - 10, rand*10+15,5);
	}
}
postLoad();
